var cat = {
	"cloth":"Одежда и обувь",
	"equip":"Снаряжение",
	"clean":"Гигиена и косметика",
	"cook":"Посуда и кулинария",
	"gadg":"Гаджеты",
	"docs":"Документы",
	"aid":"Аптечка",
	"climb":"Скалолазание",
	"board":"Сноуборд",
	"fish":"Рыбалка",
	"hunt":"Охота",
};

var arr = {
	"camping": {
		"cloth":[
			"Баф",
			"Футболка",
			"Футболка длинный рукав",
			"Шорты сменные",
			"Свитер/реглан",
			"Штаны",
			"Шлепанцы/сандали",
			"Носки сменные (1 пара на день)",
			"Белье сменное (1 на день)",
			"Спальный комплект"
		],
		"equip":[
			"Нож",
			"Пятиточеник",
			"Палатка",
			"Спальник",
			"Фонарик + батарейки",
			"Топор/мачете",
			"Каремат",
			"Мусорные пакеты",
			"Зажигалка"
		],
		"clean":[
			"Салфетки влажные",
			"Расческа",
			"Зубная паста/щетка",
			"Дезодорант",
			"Туалетная бумага"
		],
		"cook":[
			"Кружка",
			"Ложка",
			"Миска",
			"Котелок"
		],
		"gadg":[
			"Смартфон + зарядка",
			"Портативная колонка",
			"Наушники"
		]
	},
	"picnic": {
		"equip":[
			"Нож",
			"Пятиточеник",
			"Каремат",
			"Зажигалка"
		],
		"clean":[
			"Салфетки влажные",
			"Туалетная бумага"
		],
		"cook":[
			"Кружка",
			"Ложка",
			"Миска",
		],
		"gadg":[
			"Смартфон + зарядка",
			"Портативная колонка",
			"Наушники"
		]
	},
	"hiking": {
		"cloth":[
			"Баф",
			"Футболка",
			"Футболка длинный рукав",
			"Свитер/реглан",
			"Шорты сменные",
			"Штаны",
			"Шлепанцы/сандали",
			"Сменная обувь",
			"Носки сменные (1 пара на день)",
			"Белье сменное (1 на день)",
			"Спальный комплект"
		],
		"equip":[
			"Карта",
			"Топор/мачете",
			"Компасс",
			"Нож",
			"Пятиточеник",
			"Палатка",
			"Спальник",
			"Фонарик + батарейки",
			"Каремат",
			"Мусорные пакеты",
			"Зажигалка"
		],
		"clean":[
			"Салфетки влажные",
			"Расческа",
			"Зубная паста/щетка",
			"Дезодорант",
			"Шампунь",
			"Мыло/гель для душа",
			"Туалетная бумага"
		],
		"cook":[
			"Кружка",
			"Ложка",
			"Миска",
			"Котелок"
		],
		"gadg":[
			"Смартфон + зарядка",
			"Портативная колонка",
			"Наушники"
		]
	},
	"abroad": {
		"gadg":[
			"Переходник для розетки",
			"Наушники",
			"Смартфон + зарядка"
		],
		"docs":[
			"Загран пасспорт",
			"Водительское удостоверение",
			"Студенческий билет/ ISIC",
			"Копии документов",
			"Билеты",
			"Разменять деньги",
			"Бронь в гостинице"
		]
	},
	"tour": {
		"gadg":[
			"Наушники",
			"Смартфон + зарядка"
		],
		"docs":[
			"Пасспорт",
			"Водительское удостоверение",
			"Студенческий билет/ ISIC",
			"Билеты"
		],
		"cook":[
			"Термокружка/термос",
		],
		"clean":[
			"Салфетки влажные",
			"Туалетная бумага"
		],
	},
	"trip": {
		"cloth":[
			"Футболка",
			"Футболка длинный рукав",
			"Свитер/реглан",
			"Шорты сменные",
			"Штаны",
			"Шлепанцы/сандали",
			"Носки сменные (1 пара на день)",
			"Белье сменное (1 на день)",
			"Спальный комплект"
		],
		"gadg":[
			"Наушники",
			"Смартфон + зарядка"
		],
		"docs":[
			"Пасспорт",
			"Водительское удостоверение",
			"Студенческий билет/ ISIC",
			"Билеты"
		],
		"cook":[
			"Термокружка/термос",
			"Вода в поезд",
			"Еда"
		],
		"clean":[
			"Салфетки влажные",
			"Расческа",
			"Зубная паста/щетка",
			"Дезодорант",
			"Шампунь",
			"Мыло/гель для душа",
			"Туалетная бумага"
		],
		"equip":[
			"Нож"
		],

	},
	"cooking": {
		"cook":[
			"Шампура",
			"Мангал",
			"Барбекю",				
			"Дрова/уголь",				
			"Нож",				
			"Соль",				
			"Продукты/мясо"				
		],
		"equip":[			
			"Топор/мачете"				
		],
	},
	"woman": {
		"clean":[
			"Прокладки/тампоны",
			"Средство для умывания",
			"Спонжики",
			"Зеркальце",
			"Крема",
			"Ножнички",
			"Резинка для волос",
			"Бальзам для волос",
			"Гигиеническая помада"					
		]				
	},
	"cold": {
		"cloth":[
			"Куртка",
			"Термобелье",
			"Шапка"
		]
	},
	"hot": {
		"cloth":[
			"Головной убор(панама, кепка)"
		],
		"equip":[
			"Солнечные очки"
		],
		"aid":[
			"Солнцезащитный крем"
		]
	},
	"rain": {
		"equip":[
			"Дождевик",
			"Клеенка/тент"
		]
	},
	"photo": {
		"gadg":[
			"Фотоаппарат + зарядка"
		]
	},
	"video": {
		"gadg":[
			"Видеокамера + зарядка"
		]
	},
	"notebook": {
		"gadg":[
			"Ноутбук + зарядка"
		]
	},
	"tablet": {
		"gadg":[
			"Планшет + зарядка"
		]
	},
	"swiming": {
		"clean":[
			"Полотенце"
		],
		"equip":[
			"Подводные очки/ маска"
		],
		"cloth":[
			"Купальник/ плавки",
		]
	},
	"climbing": {
		"equip":[
			"Веревки",
			"Карабины",
			"Система"
		]
	},
	"hunting": {
		"hunt":[
			"Ружье",
			"Патроны",
			"Нож",
			"Пыжи",
			"Порох"
		]
	},
	"fishing": {
		"fish":[
			"Спининг",
			"Катушка",
			"Снасти",
			"Наживка",
			"Садок",
			"Щипцы длинные",
			"Ремкомплект",
			"Доска",
			"Терка",
			"Чистка"
		],
		"cloth":[
			"Сапоги резиновые"					
		]
	},
	"boarding": {
		"docs":[
			"Сноуборд",
			"Крепы",
			"Очки",
			"Шлем",
			"Воск",
			"Боты"
		]
	},
	"medicine": {
		"aid":[
			"Лейкопластырь",
			"Бинт",
			"Активированный уголь",
			"Бинт нестерильный",
			"Спирт медицинский",
			"Хлоргексидин/Йод",
			"Кларитин/Cупрастин",
			"Фталазол",
			"Панкреатин",
			"Парацетамол",
			"Аналгин/цитрамон",
			"Спазмалгон/Кеторолак(кетанов)",
			"Аспирин",
			"Звездочка",
			"Бепантен"
		]
	}
};




$('document').ready(function(){

	//Показываем и скрываем по нажатию дополнительную информацию
	$('.btn-info').click(function(){ 
		$('.info').fadeToggle("slow");
		$('.tips').fadeOut(50);
	});
	$('.btn-remember').click(function(){ 
		$('.remember').fadeToggle("slow");
		$('.tips').fadeOut(50);
	});
	$('.remember .close').click(function(){ 
		$('.remember').fadeOut("slow");
	});
	$('.info .close').click(function(){ 
		$('.info').fadeOut("slow");
	});
	

	
	$(".check").click(function(Event){ 
			console.log(Event.target);
			//Скрываем подсказку
			$('.tips').fadeOut(50);

	    	//Удаляем класс "active", кнопка переходит в ненажатое состояние
	    	$(this).toggleClass("active");	
			$("#content").remove();
					
			$(".packlist").append("<div id='content'></div>");
			
			var el = $(".check.active");

			el.each(function(index, value){

				var newId = $(value).parent().attr("id");
	
				//Выводим элементы ассоциированного массива для конкретной нажатой кнопки с категорией newId
				for(var item in arr[newId]){

					//Выводим div с названием категории
					$("#content").append("<article class='"+ item +"'></article>");
					$("#content").find("article." + item).append("<div class='title " + newId + "'" + "data="+ item + ">" + cat[item] + "</div>");
					
					//Выводим div с элементами массива
					$.each(arr[newId][item], function(key, val) {
						$("#content").find("article." + item).append("<div class='" + newId + "'" + "data="+ item + ">" + val + "</div>");
					});
				}

				//Анимируем появление
				$('article .'+ newId).animate({    
							"top":"0px"
				}, 500);				
			}); 


			//Добавляем класс hidden для повторяющихся элементов DOM
			var supervise2 = {};
			$('article div').each(function() {
				var txt = $(this).text();
				if (supervise2[txt])
					$(this).remove();
				else
					supervise2[txt] = true;
			});
			
		

			
			function disableList(selector, target)
			{
				//Записываем в переменную id родителя, которое соответствует div с таким же именем класса      
				var addItems = $(selector);    
						
				if(addItems.length > 0){				
					$(target).addClass('disable');
					$(target + " .check").addClass('fake');
					$(target + " .check").removeClass('check');
					
				}
				else {
					$(target).removeClass('disable');
					$(target).addClass('category');
				}			
			}
			
			disableList(".nature .check.active", '.civil');
			disableList(".civil .check.active", '.nature');
			
			
	});
});











